
#+TITLE: Josh's Time Log
#+AUTHOR: Josh Wilhelm
#+DATE: Spring 2014
#+STARTUP: content indent logdrawer lognoteclock-out lognotedone

* WordSurv 2.0                                                     :jwilhelm:
** Learning/Research/Setup                                        :jwilhelm:
*** DONE Learn org mode [2/2]
CLOSED: [2014-02-22 Sat 18:30]
:LOGBOOK:
- CLOSING NOTE [2014-02-22 Sat 18:30] \\
  I think I know how to use it pretty well.
:END:
:PROPERTIES:
:Effort:   2:30
:END:
CLOCK: [2014-02-16 Sun 20:48]--[2014-02-16 Sun 21:18] =>  0:30
- Still learning.
CLOCK: [2014-02-16 Sun 20:31]--[2014-02-16 Sun 20:35] =>  0:04
- Starting to get it.
CLOCK: [2014-02-16 Sun 20:28]--[2014-02-16 Sun 20:28] =>  0:00
CLOCK: [2014-02-16 Sun 20:03]--[2014-02-16 Sun 20:21] =>  0:18
- [X] Learn how to customize start up
- [X] David O'Toole Org [[http://orgmode.org/worg/org-tutorials/orgtutorial_dto.html][tutorial]]
SCHEDULED: <2014-02-16 Sun>
CLOCK: [2014-02-16 Sun 20:32]--[2014-02-16 Sun 20:40] =>  0:08
- Did the tutorial and figured out how to make checkboxes.
*** Emacs customization
:LOGBOOK:
CLOCK: [2014-02-26 Wed 19:49]--[2014-02-26 Wed 21:05] =>  1:16
- Added a bunch of Django stuff to emacs!
:END:
**** TODO Try to get my timelog file to open in a buffer when I start emacs without screwing up everything
*** DONE Refresher on Git
CLOSED: [2014-02-22 Sat 18:53]
:LOGBOOK:
- CLOSING NOTE [2014-02-22 Sat 18:53] \\
  I think I git it.
:END:
**** DONE Git documentation book [5/5] [[http://git-scm.com/documentation][Documentation]]
CLOSED: [2014-02-22 Sat 18:53]
:LOGBOOK:
- CLOSING NOTE [2014-02-22 Sat 18:53] \\
  Finished!
CLOCK: [2014-02-22 Sat 16:45]--[2014-02-22 Sat 18:53] =>  2:08
CLOCK: [2014-02-19 Wed 09:41]--[2014-02-19 Wed 09:52] =>  0:11
- Time for chapel!
CLOCK: [2014-02-19 Wed 09:34]--[2014-02-19 Wed 09:35] =>  0:01
- trying to get everything commited properly
CLOCK: [2014-02-19 Wed 09:28]--[2014-02-19 Wed 09:31] =>  0:03
:END:
- [X] 1 Getting Started
- [X] 2 Git Basics
- [X] 3 Git Branching
- [X] 6 Git Tools
- [X] 7 Customizing Git
***** Time                                                         :jwilhelm:
CLOCK: [2014-02-18 Tue 15:05]--[2014-02-18 Tue 15:05] =>  0:00
CLOCK: [2014-02-18 Tue 15:04]--[2014-02-18 Tue 15:05] =>  0:01
- Class time.
CLOCK: [2014-02-18 Tue 13:54]--[2014-02-18 Tue 14:34] =>  0:40
- Class time.
CLOCK: [2014-02-18 Tue 13:32]--[2014-02-18 Tue 13:52] =>  0:20
- Finished git tutorial chapter 1.
CLOCK: [2014-02-16 Sun 21:18]--[2014-02-16 Sun 21:31] =>  0:13
- Made it through 1.3. Start from [[http://git-scm.com/book/en/Getting-Started-Installing-Git][1.4]] next 
*** VM Maintenance
**** DONE Install Chrome
CLOSED: [2014-02-22 Sat 19:03]
:LOGBOOK:
- CLOSING NOTE [2014-02-22 Sat 19:03] \\
  It's working!
CLOCK: [2014-02-22 Sat 18:55]--[2014-02-22 Sat 19:03] =>  0:08
:END:
**** DONE Update Ubuntu
CLOSED: [2014-02-22 Sat 16:40]
:LOGBOOK:
- CLOSING NOTE [2014-02-22 Sat 16:40] \\
  Done
:END:
**** DONE Reinstall guest editions
CLOSED: [2014-02-22 Sat 16:50]
:LOGBOOK:
- CLOSING NOTE [2014-02-22 Sat 16:50]
:END:
**** DONE Setup Git RSA keys for ssh option
CLOSED: [2014-02-25 Tue 16:42]
:LOGBOOK:
- CLOSING NOTE [2014-02-25 Tue 16:42]
CLOCK: [2014-02-25 Tue 16:16]--[2014-02-25 Tue 16:41] =>  0:25
- Done!
:END:
<<<<<<< HEAD
**** DONE Expand my VM's .vdi drive by a few gigs
CLOSED: [2014-04-07 Mon 00:31]
:LOGBOOK:
- CLOSING NOTE [2014-04-06 Sun 23:21] \\
  That wasn't as hard as Ryan made it look.
CLOCK: [2014-04-06 Sun 22:31]--[2014-04-06 Sun 23:21] =>  0:50
:END:
=======
*** Trying out the koding VM 					   :jwilhelm:
CLOCK: [2014-03-08 Sat 18:30]--[2014-03-08 Sat 20:30] =>  2:00
- Looks pretty cool! Got the server up and running on it.
>>>>>>> 7fedecaa742062dcde845b0cddc7ba8c17ba7b2f
** Survey View                                                    :jwilhelm:
*** Django refresher                                             :jwilhelm:
:LOGBOOK:
CLOCK: [2014-02-24 Mon 18:41]--[2014-02-24 Mon 21:08] =>  2:27
- Little Django refresher and started creating my survey view.
:END:
*** Survey View
:LOGBOOK:
CLOCK: [2014-02-25 Tue 15:50]--[2014-02-25 Tue 16:13] =>  0:23
- Fixed up my survey view to be better.
:END:
*** Variety CRUD page
:LOGBOOK:
CLOCK: [2014-03-04 Tue 21:00]--[2014-03-04 Tue 22:50] =>  1:50
- Still trying to get the varieties working. I think I'm getting a little confused by the UX Diagram.
:END:
** XML Importer
*** Get WordSurv set up on my computer
:LOGBOOK:
CLOCK: [2014-04-05 Sat 14:14]--[2014-04-05 Sat 16:10] =>  1:56
- Got Wordsurv up and running now I can make some sample XML files of my own to import.
:END:
*** Create a few XML files to test on the importer
:LOGBOOK:
CLOCK: [2014-04-05 Sat 20:26]--[2014-04-05 Sat 21:13] =>  0:44
- Done!
:END:
** Papers                                                         :jwilhelm:
*** In the Beginning was the Command Line
:LOGBOOK:
CLOCK: [2014-03-01 Sat 13:05]--[2014-03-01 Sat 14:30] =>  1:25
- Good read!
:END:
** Class Time                                                     :jwilhelm:
*** 02/18/14                                                     :jwilhelm:
CLOCK: [2014-02-18 Tue 15:20]--[2014-02-18 Tue 16:00] =>  0:40
CLOCK: [2014-02-18 Tue 15:06]--[2014-02-18 Tue 15:20] =>  0:14
- Class time.
CLOCK: [2014-02-18 Tue 14:35]--[2014-02-18 Tue 15:04] =>  0:29
- Class time.
*** 02/20/14                                                     :jwilhelm:
:LOGBOOK:
CLOCK: [2014-02-20 Thu 13:50]--[2014-02-20 Thu 16:08] =>  2:18
- Class time.
:END:
*** 02/25/14                                                     :jwilhelm:
:LOGBOOK:
CLOCK: [2014-02-25 Tue 13:40]--[2014-02-25 Tue 15:49] =>  2:09
- Class Time
:END:

*** 02/27/14                                                     :jwilhelm:
:LOGBOOK:
CLOCK: [2014-02-27 Thu 13:50]--[2014-02-27 Thu 16:07] =>  2:17
- Class time - nginx and work on surveys page
:END:
*** 03/04/14                                                     :jwilhelm:
:LOGBOOK:
CLOCK: [2014-03-04 Tue 14:39]--[2014-03-04 Tue 16:19] =>  1:40
- Class is over made some progress and found a cool emacs package! https://github.com/fgallina/python-django.el

CLOCK: [2014-03-04 Tue 14:00]--[2014-03-04 Tue 14:38] =>  0:38
- time to push.
:END:
*** 03/06/14                                                     :jwilhelm:
:LOGBOOK:
CLOCK: [2014-03-06 Thu 13:55]--[2014-03-06 Thu 15:59] =>  2:04
- My machine crashed in the middle of class. Finally got it back up and running and everything is normal.
:END:
*** 03/11/14                                                     :jwilhelm:
CLOCK: [2014-03-11 Tue 13:35]--[2014-03-11 Tue 15:43] =>  2:08
*** 03/13/14                                                     :jwilhelm:
CLOCK: [2014-03-13 Thu 16:03]--[2014-03-13 Thu 17:31] =>  1:28
- Waiting for Nate an reading emacs docs... He didn't come.
CLOCK: [2014-03-13 Thu 14:00]--[2014-03-13 Thu 16:03] =>  2:03
- Class time
*** 04/01/14                                                     :jwilhelm:
:LOGBOOK:
CLOCK: [2014-04-01 Tue 14:01]--[2014-04-01 Tue 15:59] =>  1:52
- Computer is actually running for more than 5 minutes again!
:END:
*** 04/03/14                                                     :jwilhelm:
:LOGBOOK:
CLOCK: [2014-04-03 Thu 14:00]--[2014-04-03 Thu 16:00] =>  2:00
- Working on testing Adam's xml importer, tried installing it on lab machine but it didn't work. Oh well...
:END:
*** 04/08/14                                                     :jwilhelm:
:LOGBOOK:
CLOCK: [2014-04-08 Tue 14:03]--[2014-04-08 Tue 15:00] =>  0:57
- Class time - about to commit as much of my time as I could compile.
:END:

